In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("train.csv") # Load Dataframe

In [5]:
df.head() # Display first 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.tail() # Display last 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
type(df)

pandas.core.frame.DataFrame

In [10]:
# selecting only one column
series = df["PassengerId"] # df[list]->df[["PassengerId"]]
series

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [11]:
type(series)

pandas.core.series.Series

In [13]:
# selecting passengerId and Name
list1 = ["PassengerId","Name"]
df[list1] #df[["PassengerId","Name"]]

     PassengerId                                               Name
0              1                            Braund, Mr. Owen Harris
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3                             Heikkinen, Miss. Laina
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5                           Allen, Mr. William Henry
..           ...                                                ...
886          887                              Montvila, Rev. Juozas
887          888                       Graham, Miss. Margaret Edith
888          889           Johnston, Miss. Catherine Helen "Carrie"
889          890                              Behr, Mr. Karl Howell
890          891                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [14]:
type(df[list1])

pandas.core.frame.DataFrame

In [16]:
# similar manner we are selecting only pasengerID
list1 =["PassengerId"]
df[list1] # df[["PassengerId"]]->Dataframe and df['PassengerID']->Series

     PassengerId
0              1
1              2
2              3
3              4
4              5
..           ...
886          887
887          888
888          889
889          890
890          891

[891 rows x 1 columns]

In [17]:
type(df[list1])

pandas.core.frame.DataFrame

In [19]:
# selecitng 2 cols withour list
df["PassengerId","Name"]  #Error to correct it ->df[["PassengerId","Name"]]

KeyError: ('PassengerId', 'Name')

In [20]:
# create the series
'''pd.Series(iterable objects)''' 
series1 = pd.Series([1,2,3,4,5]) #series without name
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
series2 = pd.Series([1,2,3,4,5],name ="Test") #series with name
series2

0    1
1    2
2    3
3    4
4    5
Name: Test, dtype: int64

In [22]:
series3 = pd.Series([1,2,3,4,5],name ="Test1",dtype=float) # series with changed data type
series3

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: Test1, dtype: float64

In [23]:
# heterogeneous series
list2 = ["Parmeet",1,2.0] # we always prefer series to be of homonegenous data type
pd.Series(list2) # datatype is object

0    Parmeet
1          1
2        2.0
dtype: object

In [24]:
series4 = pd.Series(["Parmeet","Singh","Dang"])
series4

0    Parmeet
1      Singh
2       Dang
dtype: object

In [25]:
pd.Series([1,2,3,4,5]) # 0,1,2,3,4,5 are indexes

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [27]:
#change the index name
series5 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
series5

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [28]:
pd.Series([1,2,3,4,5],index=['a','b','c','d'])  #error - as the index size doesnot match with the series size

ValueError: Length of passed values is 5, index implies 4.

In [29]:
# viewing any one series
series3

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: Test1, dtype: float64

In [33]:
# extracting seris using index
series3[0]

1.0

In [34]:
series3[3] # series[idx_number/idx_name]

4.0

In [32]:
#viewing named series5
series5

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [35]:
series5['d']

4

In [37]:
series5[a] #error as the index names are strings

NameError: name 'a' is not defined

In [44]:
# operation on the series
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [47]:
series1.add(2) # add funtion is to add 2 seris or add a series with a scalar value

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [49]:
series1.sub(2)

0   -1
1    0
2    1
3    2
4    3
dtype: int64

In [51]:
series1.mul(2)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [54]:
series1.add(series2) #adding 2 series

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [56]:
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [55]:
series1.sum()

15

In [58]:
series6 = pd.Series([1,2,3])
series6

0    1
1    2
2    3
dtype: int64

In [59]:
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [103]:
#length of series not matching
series_nan = series1.add(series6) #NAN values (4+missing value = NAN)
series_nan

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [61]:
series1.div(series6)

0    1.0
1    1.0
2    1.0
3    NaN
4    NaN
dtype: float64

In [63]:
# count the number of elements in the series
series.count()

891

In [65]:
series1.count()

5

In [69]:
series4

0    Parmeet
1      Singh
2       Dang
dtype: object

In [71]:
series4.size #without function sign

3

In [72]:
series1.size

5

In [74]:
series.size

891

In [79]:
# creating another series
series7 = pd.Series([26,1,5,87,9,100])
series7

0     26
1      1
2      5
3     87
4      9
5    100
dtype: int64

In [81]:
series8 = series7.sort_values() # sort on basis on values
series8

1      1
2      5
4      9
0     26
3     87
5    100
dtype: int64

In [83]:
# sort on basis on index
series8.sort_index()

0     26
1      1
2      5
3     87
4      9
5    100
dtype: int64

In [84]:
series8.argmax() # extracting index number of highest value in the series

5

In [89]:
series.argmax()

890

In [90]:
# see the element at that index
series8[series8.argmax()]

100

In [91]:
series[series.argmax()]

891

In [93]:
# find the minimum element index in the series
series.argmin()

0

In [96]:
series7.argmin()

1

In [97]:
#fetching min ele
series7[series7.argmin()]

1

In [98]:
series[series.argmin()]

1

In [100]:
series7

0     26
1      1
2      5
3     87
4      9
5    100
dtype: int64

In [101]:
# sort using argsort - indexes
series7.argsort()

0    1
1    2
2    4
3    0
4    3
5    5
dtype: int64

In [102]:
series7[series7.argsort()] #sorted series

1      1
2      5
4      9
0     26
3     87
5    100
dtype: int64

In [104]:
#let us apply count function and size function on series_nan
series_nan

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [105]:
series_nan.count() #non-null values

3

In [107]:
series_nan.size #number of elements present inside the series, irrespective of nan values

5

# Dataframes

In [108]:
# create a new dataframe using dictionary
dict1 = {"Name":["Parmeet","Trishaan","Anit"], "Age":[27,3,10]}
dict1

{'Name': ['Parmeet', 'Trishaan', 'Anit'], 'Age': [27, 3, 10]}

In [112]:
#converting dictionary to dataframe
df1 = pd.DataFrame(dict1)
df1

       Name  Age
0   Parmeet   27
1  Trishaan    3
2      Anit   10

In [113]:
df2 = pd.DataFrame(dict1,index=["a","b","c"]) #dataframe with explicitly defining index names
df2

       Name  Age
a   Parmeet   27
b  Trishaan    3
c      Anit   10

In [114]:
#extract the column names in the datframe
df2.columns #dataframename.columns

Index(['Name', 'Age'], dtype='object')

In [115]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [116]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [125]:
# run time while reading selecting few columns
pd.read_csv("train.csv",index_col="PassengerId")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [126]:
# information of the dataframe
df.info() #dataframe.info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [127]:
# analyse the Age columns
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [131]:
# let us now see the how many null/missing values exists in age columns
df['Age'].isnull().sum()

177

<font size ="3"> 177 mising values in Age column

In [132]:
# we want to check missing values in whole dataframe
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [134]:
# let us say we need to extract the index names
df2

       Name  Age
a   Parmeet   27
b  Trishaan    3
c      Anit   10

In [136]:
df2.index #extracting the index

Index(['a', 'b', 'c'], dtype='object')

In [158]:
# creating a dataframe with duplicate values
df3 = pd.DataFrame({"Id":[1,2,3,4,5,6,7],"Marks":[100,60,70,60,40,60,40]})
df3

   Id  Marks
0   1    100
1   2     60
2   3     70
3   4     60
4   5     40
5   6     60
6   7     40

In [143]:
df3['Marks'].unique() #unique values

array([100,  60,  70,  40], dtype=int64)

In [144]:
# we want to count the number of unique values
df3['Marks'].nunique()

4

In [148]:
# I want to count how many times that unique value exists
df3['Marks'].value_counts()

60     3
40     2
100    1
70     1
Name: Marks, dtype: int64

In [152]:
# series representation to numpy
df3['Marks'].values

array([100,  60,  70,  60,  40,  60,  40], dtype=int64)

In [153]:
df3

   Id  Marks
0   1    100
1   2     60
2   3     70
3   4     60
4   5     40
5   6     60
6   7     40

In [160]:
# rename the column marks to percentage
df3.rename(columns={"Marks":"Percentage"},inplace = True)
# Alternate way : df3 = df3.rename(columns={"Marks":"Percentage"})

In [161]:
df3

   Id  Percentage
0   1         100
1   2          60
2   3          70
3   4          60
4   5          40
5   6          60
6   7          40

In [163]:
#change multiple columns names
df3.rename(columns={"Id":"S_ID","Percentage":"Marks"}, inplace = True)

In [164]:
df3

   S_ID  Marks
0     1    100
1     2     60
2     3     70
3     4     60
4     5     40
5     6     60
6     7     40

# Indexing in dataframe

In [166]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [167]:
# Filter the columns
df[["Name","Age","Survived"]]

                                                  Name   Age  Survived
0                              Braund, Mr. Owen Harris  22.0         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
2                               Heikkinen, Miss. Laina  26.0         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
4                             Allen, Mr. William Henry  35.0         0
..                                                 ...   ...       ...
886                              Montvila, Rev. Juozas  27.0         0
887                       Graham, Miss. Margaret Edith  19.0         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN         0
889                              Behr, Mr. Karl Howell  26.0         1
890                                Dooley, Mr. Patrick  32.0         0

[891 rows x 3 columns]

In [172]:
# filtering the rows, where Pclass is 3
df["Pclass"]==3

0       True
1      False
2       True
3      False
4       True
       ...
886    False
887    False
888     True
889    False
890     True
Name: Pclass, Length: 891, dtype: bool

In [175]:
# extracting all the filtered row values
condition = df["Pclass"]==3
df[condition]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [176]:
# filter the rows based on multiple conditions  extracting rows where Pclas is 3 and who survived
df['Survived'] ==1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [178]:
# combine survived condition and Pclass condition -> boolean operators (&,|)
(df["Pclass"]==3) & (df['Survived'] ==1)

0      False
1      False
2       True
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [185]:
# let su fetch all the filtered rows
condition = (df["Pclass"] ==3) & (df['Survived'] == 1)
df[condition]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
838,839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.3500,NaN,S
858,859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24.0,0,3,2666,19.2583,NaN,C
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C

In [189]:
# Combining - We want to filter the rows and columns in one go
# let us find all the rows where Pclass is 3 and extract the Name, Age and Embarked

row_condition = (df['Pclass'] ==3)
col_condition = ["Name","Age","Embarked","Pclass"]

#dataframe filtering - df.loc[rows,cols] rows =[start:stop:step],cols =[start:stop:step]
df.loc[row_condition,col_condition] 

# df.loc[(df['Pclass'] ==3),["Name","Age","Embarked","Pclass"]]

                                         Name   Age Embarked  Pclass
0                     Braund, Mr. Owen Harris  22.0        S       3
2                      Heikkinen, Miss. Laina  26.0        S       3
4                    Allen, Mr. William Henry  35.0        S       3
5                            Moran, Mr. James   NaN        Q       3
7              Palsson, Master. Gosta Leonard   2.0        S       3
..                                        ...   ...      ...     ...
882              Dahlberg, Miss. Gerda Ulrika  22.0        S       3
884                    Sutehall, Mr. Henry Jr  25.0        S       3
885      Rice, Mrs. William (Margaret Norton)  39.0        Q       3
888  Johnston, Miss. Catherine Helen "Carrie"   NaN        S       3
890                       Dooley, Mr. Patrick  32.0        Q       3

[491 rows x 4 columns]

In [210]:
# df.iloc ->i refers to index numbers

row_index = np.arange(0,890,2)
col_index = [1,3,6,8]

#dataframe filtering - df.iloc[rows,cols] rows =[start:stop:step],cols =[start:stop:step]
df.iloc[row_index,col_index]

,Survived,Name,SibSp,Ticket
0,0,"Braund, Mr. Owen Harris",1,A/5 21171
2,1,"Heikkinen, Miss. Laina",0,STON/O2. 3101282
4,0,"Allen, Mr. William Henry",0,373450
6,0,"McCarthy, Mr. Timothy J",0,17463
8,1,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,347742
...,...,...,...,...
880,1,"Shelley, Mrs. William (Imanita Parrish Hall)",0,230433
882,0,"Dahlberg, Miss. Gerda Ulrika",0,7552
884,0,"Sutehall, Mr. Henry Jr",0,SOTON/OQ 392076
886,0,"Montvila, Rev. Juozas",0,211536
888,0,"Johnston, Miss. Catherine Helen ""Carrie""",1,W./C. 6607

In [211]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [213]:
#selecting 5th row from the above dataframe
df.iloc[4]

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                35.0
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Name: 4, dtype: object

In [214]:
df.shape

(891, 12)